Cannot align the support on the posts.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId CannotAlignSupportOnPosts { get; }
  Visual Basic
Public Shared ReadOnly Property CannotAlignSupportOnPosts As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ CannotAlignSupportOnPosts {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures StairRampFailures Class
  Autodesk.Revit.DB Namespace